frontend/controllers/SiteController.php

SELECT COUNT(*) FROM `tbl_post`
SELECT * FROM `tbl_post` ORDER BY `created_at` DESC LIMIT 20
---
    public function actionIndex()
    {
    	$query = Post::find()->orderBy(['created_at'=>SORT_DESC]);
    	$countQuery = clone $query;
    	$pages = new Pagination(['totalCount' => $countQuery->count()]);

    	$models = $query->offset($pages->offset)
    	->limit($pages->limit)
    	->all();

SELECT * FROM `tbl_post` WHERE (`type`='ama') AND (`status`=1) ORDER BY `id` LIMIT 1
UPDATE `tbl_post` SET `count`=39 WHERE `id`=4
---
    protected function findAbout($var){
    	$model = Post::find()->where(['type'=>$var])->andWhere(['status'=>1])
    	->orderBy(['id'=>SORT_ASC])->limit(1)->one();

    	if (!is_null($model)) {

    		if($this->ipUser()){
    			$model->count = $model->count + 1;
    			$model->save(false);

SELECT * FROM `tbl_profile` ORDER BY `id` LIMIT 1
---
    public function actionMe(){
    	$model = Profile::find()->orderBy(['id'=>SORT_ASC])->limit(1)->one();