backend/views/post/_form.php

SELECT * FROM `tbl_category`
---
            <?= $form->field($model, 'descripcion')->textArea(['maxlength' => 500,'rows' => '4']) ?>
            <?= $form->field($model, 'keyword')->textInput(['maxlength' => true]) ?>
            <?= $form->field($model, 'repo')->textInput(['maxlength' => true]) ?>
            <?= $form->field($model, 'categories')->widget(Select2::classname(), [
               'data' => $data = ArrayHelper::map(Category::find()->all(),'id','name'),
               'options' => ['value'=> $model->categories,  'placeholder' => 'Select categories...', 'multiple' => true],
               'pluginOptions' => [
               'categories' => true,
               'tokenSeparators' => [',', ' '],
               'maximumInputLength' => 10
               ],
               ])->label('Categories'); ?>