backend/views/layouts/footer.php

SELECT * FROM `tbl_profile` ORDER BY `id` LIMIT 1
---
<?php
use backend\models\Profile;

$profile = Profile::find()->orderBy('id ASC')->limit(1)->one();