frontend/views/layouts/footer.php

<?php
use backend\models\Profile;

$profile = Profile::find()->orderBy('id ASC')->limit(1)->one();
---
SELECT * FROM `tbl_profile` ORDER BY `id` LIMIT 1